{
  "Программист": "Programmer",
  "Мариев Владимир": "Vladimir Mariev",
  "Обо мне": "About me",
  "Услуги": "Services",
  "Отзывы": "Reviews",
  "Контакты": "Contacts",
  "Full-Stack веб-разработчик": "Full-Stack Web Developer",
  "Установить контакт": "Сontact with me",
  "Опыт работы более 5 лет": "Work experience more than 5 years",
  "Имею опыт решения задач различных сложностей. Более подробно о моей карьере смотрите на": "I have experience in solving problems of various complexities. For more information about my career, see",
  "Большой набор инструментов": "Large set of tools",
  "Позволяет мне быстро и легко адаптироваться под разные условия разработки с использование сторонних готовых решений": "Allows me to quickly and easily adapt to different development conditions using third-party ready-made solutions",
  "Разработка проекта под ключ": "Turnkey project development",
  "Сопровождаю проект на всех этапах разработки. От дизайна и проработки идеи, до запуска проекта на сервере": "I accompany the project at all stages of development. From design and idea development to launching the project on the server",
  "Сделать заказ": "Make an order",
  "бесплатно": "free",
  "Chrome": "Chrome",
  "Консультация": "Consultation",
  "Анализируем запрос клиента. Ставим задачи, устанавливаем сроки. Выбираем инструменты.": "We analyze the client's request. We set tasks, set deadlines. We select tools.",
  "Frontend разработка": "Frontend development",
  "ts": "ts",
  "js": "js",
  "Py": "Py",
  "Создание веб приложений. Разработка приложения целиком, либо частично. Создание модулей, компонентов, настройка API, доработка бизнес логики, рефаторинг, оптимизация приложения.": "Creation of web applications. Development of the application in whole or in part. Creation of modules, components, API configuration, refinement of business logic, refactoring, application optimization.",
  "Backend разработка": "Backend development",
"Создание REST API сервисов. Авторизация, аунтификация. Создание контролеров и моделей для взимоделйствия с базой данных. Написание ендпоинтов.": "Creation of REST API services. Authorization, authentication. Creation of controllers and models for interaction with the database. Writing endpoints.",
"Разработка UI дизайна":"UI design development",
"Figma":"Figma",
"Проектирование интерфейсов веб/мобильных приложений.": "Web/mobile application interface design.",
"Написание парсеров": "Writing parsers",
"Написание парсеров данных под определенные сайты": "Writing data parsers for specific sites",
"Web тестирование": "Web testing",
"Firefox": "Firefox",
"Safari": "Safari",
"Ручное тестирование сайта.": "Manual testing of the site.",
"Написание автотестов": "Writing autotests",
"Написание автотесты для веб приложения": "Writing automated tests for a web application",
"Написание Unit-тестов": "Writing Unit Tests",
"Написание unit текстов для веб приложения": "Writing unit texts for a web application",
"Оптимизация web приложения":"Web application optimization",
"ReactJS": "ReactJS",
  "Провожу рефакторинг кода, оптимизирую работу веб приложения": "I refactor the code, optimize the operation of the web application",
  "сообщений":"messages"


}