{
  "Программист": "Programmer",
  "Мариев Владимир": "Vladimir Mariev",
  "Обо мне": "About me",
  "Услуги": "Services",
  "Отзывы": "Reviews",
  "Контакты": "Contacts",
  "Full-Stack веб-разработчик": "Full-Stack Web Developer",
  "Установить контакт": "Сontact with me",
  "Опыт работы более 5 лет": "Work experience more than 5 years",
  "Имею опыт решения задач различных сложностей. Более подробно о моей карьере смотрите на": "I have experience in solving problems of various complexities. For more information about my career, see",
  "Большой набор инструментов": "Large set of tools",
  "Позволяет мне быстро и легко адаптироваться под разные условия разработки с использование сторонних готовых решений": "Allows me to quickly and easily adapt to different development conditions using third-party ready-made solutions",
  "Разработка проекта под ключ": "Turnkey project development",
  "Сопровождаю проект на всех этапах разработки. От дизайна и проработки идеи, до запуска проекта на сервере": "I accompany the project at all stages of development. From design and idea development to launching the project on the server",
  "Сделать заказ": "Make an order",
  "бесплатно": "free",
  "Chrome": "Chrome",
  "Консультация": "Consultation",
  "Анализируем запрос клиента. Ставим задачи, устанавливаем сроки. Выбираем инструменты.": "We analyze the client's request. We set tasks, set deadlines. We select tools.",
  "Frontend разработка": "Frontend development",
  "ts": "ts",
  "js": "js",
  "Py": "Py",
  "Создание веб приложений. Разработка приложения целиком, либо частично. Создание модулей, компонентов, настройка API, доработка бизнес логики, рефаторинг, оптимизация приложения.": "Creation of web applications. Development of the application in whole or in part. Creation of modules, components, API configuration, refinement of business logic, refactoring, application optimization.",
  "Backend разработка": "Backend development",
"Создание REST API сервисов. Авторизация, аунтификация. Создание контролеров и моделей для взимоделйствия с базой данных. Написание ендпоинтов.": "Creation of REST API services. Authorization, authentication. Creation of controllers and models for interaction with the database. Writing endpoints.",
"Разработка UI дизайна":"UI design development",
"Figma":"Figma",
"Проектирование интерфейсов веб/мобильных приложений.": "Web/mobile application interface design.",
"Написание парсеров": "Writing parsers",
"Написание парсеров данных под определенные сайты": "Writing data parsers for specific sites",
"Web тестирование": "Web testing",
"Firefox": "Firefox",
"Safari": "Safari",
"Ручное тестирование сайта.": "Manual testing of the site.",
"Написание автотестов": "Writing autotests",
"Написание автотесты для веб приложения": "Writing automated tests for a web application",
"Написание Unit-тестов": "Writing Unit Tests",
"Написание unit текстов для веб приложения": "Writing unit texts for a web application",
"Оптимизация web приложения":"Web application optimization",
"ReactJS": "ReactJS",
  "Провожу рефакторинг кода, оптимизирую работу веб приложения": "I refactor the code, optimize the operation of the web application",
  "сообщений":"messages",
  "Регистрация": "Sign Up",
  "Для использовании инструментов нужна учетная запись": "An account is required to use the tools.",
  "Войти": "Sign In",
  "Как я работаю": "How I work",
  "Инструменты": "Tools",
  "C#": "C#",
  "Мои инструменты": "My tools",
  "Время": "Time",
  "Инструмент для отслеживания времени потраченного на задачи": "Tool for tracking time spent on tasks",
  "Монеты": "Coins",
  "Инструмент для учета расходов и управления личным капиталом": "A tool for tracking expenses and managing personal capital",
  "Инструмент в разработке": "Tool in development",
  "Вы успешно авторизовались": "You have successfully logged in",
  "Выйти": "Log out",
  "Вам будет предложена первичная консультация": "You will be offered an initial consultation",
  "Утверждаю план работы совместно с клиентом": "I approve the work plan together with the client",
  "Я принимаю оплату за каждую выполненную задачу": "I accept payment for every completed task",
  "В работе со мной вы получаете гарантийный срок": "When working with me you get a guarantee period",
  "У вас есть возможность изменить план работы": "You have the opportunity to change your work plan",
  "На консультации я внимательно разберу запрос и предложу варианты решений проблемы. Консультация позволит вам понять какие инструменты подходят для решения поставленных технических вопросов, какие есть технологические решения для вашего проекта. Объединив наши представления мы выберем наиболее  эффективную стратегию. На ее основании далее составляется план задач (техническое задание).": "During the consultation, I will carefully analyze the request and offer options for solving the problem. The consultation will allow you to understand which tools are suitable for solving the technical issues raised, and what technological solutions are available for your project. By combining our ideas, we will choose the most effective strategy. Based on it, a task plan (technical specifications) is then drawn up.",
  "Перед началом совместной работы вы получаете план сдачи заказа. В нем содержится количество необходимых к выполнению задач, срок их выполнения и стоимость. В задачах мы определяем по какой технологии будем работать, какой используется программный код и др. Такое дробление заказа на подзадачи позволит видеть результат и процесс от самого начала до итоговой версии.": "Before you start working together, you receive a delivery plan for the order. It contains the number of tasks required to be completed, the deadline for their completion and the cost. In the tasks, we determine what technology we will use, what program code is used, etc. This division of the order into subtasks will allow us to see the result and process from the very beginning to the final version.",
  "Оплата за заказ происходит поэтапно. Принимая результат по каждой из задач, клиент вносит оплату. Такой подход реализует безопасные условия сотрудничества.": "Payment for the order occurs in stages. Accepting the result for each task, the client makes a payment. This approach creates safe conditions for cooperation.",
  "Критериями для гарантийных случаев являются технические задания, прописанные в плане.  Если на этапе оценки заказа я неверно рассчитал время выполнения задачи, дополнительное время для клиента рассчитывается по гарантии. Коррекция по гарантии безоплатна.": "The criteria for warranty cases are the technical specifications specified in the plan. If at the order evaluation stage I incorrectly calculated the task completion time, additional time for the client is calculated under the guarantee. Correction under warranty is free of charge.",
  "В техническое задание (план работы) могут быть включены новые задачи за дополнительную плату. Бывает так, что новая задача оказывает влияние на задачи уже выполненные, и они нуждаются в доработке. В этом случае каждая новая задача заново оценивается по времени выполнения и стоимости услуги. При изменении плана, за уже выполненную и принятую работу оплата не возвращается.": "New tasks may be included in the terms of reference (work plan) for an additional fee. It happens that a new task affects tasks already completed, and they need to be improved. In this case, each new task is re-evaluated in terms of execution time and service cost. If the plan is changed, payment for work already completed and accepted will not be refunded.",
  "Только зарегистрированным пользователям доступны мои инструменты": "Only registered users have access to my services",
  "Пройдя авторизацию вы сможете использовать мои инструменты": "After authorization you will be able to use my tools",
  "Пароль": "Password", 
  "Текущий пользователь": "Current user",
  "Повторите пароль": "Repeat password"
}