{
    "services": [{
        "title": "Консультация",
        "isPrimary": false,
        "labes": [{
            "text": "бесплатно"
        }],
        "text": "Анализируем запрос клиента. Ставим задачи, устанавливаем сроки. Выбираем инструменты."
    }, {
        "title": "Frontend разработка",
        "isPrimary": false,
        "labes": [{
            "text": "ts"
        }, {
            "text": "js"
        }],
        "text": "Создание веб приложений. Разработка приложения целиком, либо частично. Создание модулей, компонентов, настройка API, доработка бизнес логики, рефаторинг, оптимизация приложения."
    }, {
        "title": "Backend разработка",
        "isPrimary": false,
        "labes": [{
            "text": "ts"
        }, {
            "text": "js"
        },{
            "text": "C#"
        },{
            "text": "Py"
        }],
        "text": "Создание REST API сервисов. Авторизация, аунтификация. Создание контролеров и моделей для взимоделйствия с базой данных. Написание ендпоинтов."
    }, 
    {
        "title": "Разработка UI дизайна",
        "isPrimary": false,
        "labes": [{
            "text": "Figma"
        }],
        "text": "Проектирование интерфейсов веб/мобильных приложений."
    },
    {
        "title": "Написание парсеров",
        "isPrimary": false,
        "labes": [{
            "text": "ts"
        }, {
            "text": "js"
        },{
            "text": "Py"
        }],
        "text": "Написание парсеров данных под определенные сайты"
    },  {
        "title": "Web тестирование",
        "isPrimary": false,
        "labes": [{
            "text": "Chrome"
        },{
            "text": "Firefox"
        },{
            "text": "Safari"
        }],
        "text": "Ручное тестирование сайта."
    }, {
        "title": "Написание автотестов",
        "isPrimary": false,
        "labes": [{
            "text": "ts"
        }, {
            "text": "js"
        },{
            "text": "Py"
        }],
        "text": "Написание автотесты для веб приложения"
    }, {
        "title": "Написание Unit-тестов",
        "isPrimary": false,
        "labes": [{
            "text": "ts"
        }, {
            "text": "js"
        }],
        "text": "Написание unit текстов для веб приложения"
    },{
        "title": "Оптимизация web приложения",
        "isPrimary": false,
        "labes": [{
            "text": "ts"
        }, {
            "text": "js"
        },{
            "text": "ReactJS"
        }],
        "text": "Провожу рефакторинг кода, оптимизирую работу веб приложения"
    }],
    "primary-types": ["Frontend"],
    "tools": [{
        "type": "Frontend",
        "label": "ReactJS",
        "url": "",
        "language": "TS"
    }, {
        "type": "Frontend",
        "label": "MobX",
        "url": "",
        "language": "TS"
    }, {
        "type": "Frontend",
        "label": "Redux",
        "url": "",
        "language": "TS"
    }, {
        "type": "Backend",
        "label": "Fastify",
        "language": "TS",
        "url": ""
    }, {
        "type": "Backend",
        "label": "ExpressJS",
        "language": "TS",
        "url": ""
    }, {
        "type": "Disign",
        "label": "Figma",
        "language": "Fg",
        "url": ""
    }, {
        "type": "Backend",
        "label": "Sequelize",
        "language": "TS",
        "url": "https://www.npmjs.com/package/sequelize"
    }, {
        "label": "date-fns",
        "type": "Frontend",
        "language": "TS",
        "url": "https://www.npmjs.com/package/date-fns"
    }],
    "review": [
        {
            "name": "Алексей",
            "text": "Владимир выполнил работу в точности согласно заданию, и даже когда работа была расширена значительно, оставалась на связи и предложила доделать в рамках доработку. Цена высокая, но выбирая автора, вы гарантируете выполненную работу на высоком уровне и в срок, несмотря на непредсказуемые обстоятельства.",
            "rait": 5
        },
        {
            "name": "Юрий",
            "text": "Профессионал своего дела, очень помог реализовать сложную задачу в проекте на JavaScript, React, MongoDB, Node. Смог углубиться в код и качественно доработать. Приятно иметь дело. Теперь знаю к кому обратиться в случае сложных вопросов по коду и программированию в целом!",
            "rait": 5
        },
        {
            "name": "Виталий",
            "text": "Проект выполнен в срок и качественно, без дополнительных расходов. Исполнитель в общении вежлив, идет на уступки, учитывает пожелания, все ответы незамедлительны и в прлном обьеме.",
            "rait": 5
        }
    ],
    "contacts": [
        {
            "type": "telegram",
            "url": "https://t.me/vmarievit",
            "label": "@vmarievit"
        },
        {
            "type": "email",
            "url": "mailto:info@vmariev.pro",
            "label": "info@vmariev.pro"
        },
        {
            "type": "git",
            "url": "https://github.com/kinavi",
            "label": "kinavi"
        },
        {
            "type": "linkedin",
            "url": "https://www.linkedin.com/in/vladimir-mariev-3436561a6/",
            "label": "Vladimir Mariev"
        }
    ],
    "steps":[
        {
            "titel": "Вам будет предложена первичная консультация",
            "text": "На консультации я внимательно разберу запрос и предложу варианты решений проблемы. Консультация позволит вам понять какие инструменты подходят для решения поставленных технических вопросов, какие есть технологические решения для вашего проекта. Объединив наши представления мы выберем наиболее  эффективную стратегию. На ее основании далее составляется план задач (техническое задание)."
        },
        {
            "titel": "Утверждаю план работы совместно с клиентом",
            "text": "Перед началом совместной работы вы получаете план сдачи заказа. В нем содержится количество необходимых к выполнению задач, срок их выполнения и стоимость. В задачах мы определяем по какой технологии будем работать, какой используется программный код и др. Такое дробление заказа на подзадачи позволит видеть результат и процесс от самого начала до итоговой версии."
        },
        {
            "titel": "Я принимаю оплату за каждую выполненную задачу",
            "text": "Оплата за заказ происходит поэтапно. Принимая результат по каждой из задач, клиент вносит оплату. Такой подход реализует безопасные условия сотрудничества."
        },
        {
            "titel": "В работе со мной вы получаете гарантийный срок",
            "text": "Критериями для гарантийных случаев являются технические задания, прописанные в плане.  Если на этапе оценки заказа я неверно рассчитал время выполнения задачи, дополнительное время для клиента рассчитывается по гарантии. Коррекция по гарантии безоплатна."
        },
        {
            "titel": "У вас есть возможность изменить план работы",
            "text": "В техническое задание (план работы) могут быть включены новые задачи за дополнительную плату. Бывает так, что новая задача оказывает влияние на задачи уже выполненные, и они нуждаются в доработке. В этом случае каждая новая задача заново оценивается по времени выполнения и стоимости услуги. При изменении плана, за уже выполненную и принятую работу оплата не возвращается."
        }
    ]

}